In [1]:
import pandas as pd

In [6]:
invoice = pd.read_csv('invoices.csv')  
invoice

     invoice_number invoice_date  billing_phone   total
0                16   2021-09-10   250766666601  1980.0
1                77   2023-01-18   250766666601   792.0
2               149   2023-04-08   250766666601   297.0
3               153   2024-02-19   250766666601   198.0
4               182   2020-07-07   250766666601   495.0
..              ...          ...            ...     ...
513             121   2021-09-12   250766666659   396.0
514             155   2022-01-03   250766666659  1089.0
515             220   2024-02-14   250766666659   396.0
516             599   2023-07-02   250766666659  1188.0
517             607   2024-02-28   250766666659    99.0

[518 rows x 4 columns]

In [7]:
# number of roes and columns
dt = invoice.shape
dt[0]

518

In [8]:
invoice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 518 entries, 0 to 517
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_number  518 non-null    int64
 1   invoice_date    518 non-null    object
 2   billing_phone   518 non-null    int64
 3   total           518 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 16.3+ KB

In [10]:
invoice.head()

   invoice_number invoice_date  billing_phone   total
0              16   2021-09-10   250766666601  1980.0
1              77   2023-01-18   250766666601   792.0
2             149   2023-04-08   250766666601   297.0
3             153   2024-02-19   250766666601   198.0
4             182   2020-07-07   250766666601   495.0

In [15]:
invoice.tail()

     invoice_number invoice_date  billing_phone   total
513             121   2021-09-12   250766666659   396.0
514             155   2022-01-03   250766666659  1089.0
515             220   2024-02-14   250766666659   396.0
516             599   2023-07-02   250766666659  1188.0
517             607   2024-02-28   250766666659    99.0

In [19]:
invoice.sample()

     invoice_number invoice_date  billing_phone  total
457             574   2021-05-31   250766666649   99.0

In [22]:
invoice.rename(columns= {})

Index(['invoice_number', 'invoice_date', 'billing_phone', 'total'], dtype='object')

In [30]:
invoice['invoice_date'].describe(include=all)

count            518
unique           432
top       2022-03-01
freq               4
Name: invoice_date, dtype: object

In [32]:
invoice.describe(include='all')

        invoice_number invoice_date  billing_phone        total
count       518.000000          518   5.180000e+02   518.000000
unique             NaN          432            NaN          NaN
top                NaN   2022-03-01            NaN          NaN
freq               NaN            4            NaN          NaN
mean        304.355212          NaN   2.507667e+11   762.185328
std         180.491638          NaN   1.662587e+01   426.716115
min           1.000000          NaN   2.507667e+11    99.000000
25%         147.250000          NaN   2.507667e+11   396.000000
50%         298.500000          NaN   2.507667e+11   792.000000
75%         465.750000          NaN   2.507667e+11   990.000000
max         613.000000          NaN   2.507667e+11  2376.000000